report/uml/domain.puml
@startuml Domain
' =========================
'  Mermaid-like style
' =========================
skinparam shadowing false
skinparam roundcorner 5
skinparam dpi 150

skinparam DefaultFontName "Inter"
skinparam DefaultFontSize 12
skinparam classAttributeIconSize 0

skinparam class {
  BackgroundColor #F9F9F9
  BorderColor #BFBFBF
  FontColor #333333
}

skinparam Arrow {
  Color #9E9E9E
  Thickness 1
}

hide circle
hide empty members

' =========================
'       CLASSES
' =========================

class Map <<Interface>> {
  +addObject(obj : MapObject) : void
  +removeObject(obj : MapObject) : boolean
  +getAll() : List<MapObject>
}

class MapObject <<Interface>> {
  +getPosition() : Point2D
}

class Collectible <<Interface>> {
  +getValue() : int
}

class Movable <<Interface>> {
  +moveTo(p : Point2D) : boolean
}

class Entity <<Interface>> {
  +getHealth() : int
  +takeDamage(dmg : int) : boolean
  +getWeapons() : List<Weapon>
}

class Player <<Interface>> {
  +levelUp() : void
  +getExp(exp : int) : void
}

class Enemy <<Interface>> {
  +getName() : String
}

class Weapon <<Interface>> {
  +attack(e : Enemy) : void
  +isCooldown() : boolean
  +upgrade() : void
}

class Projectile <<Interface>> {
  +getDamage() : int
}

' =========================
'      RELATIONS
' =========================

MapObject <|-- Collectible
MapObject <|-- Movable

Movable <|-- Entity
Movable <|-- Projectile

Entity <|-- Enemy
Entity <|-- Player

Entity o-- Weapon
Map o-- MapObject

Weapon <.. Projectile

@enduml
